app/views/outings/_activity_select.html.erb

SELECT 1 FROM "activities" INNER JOIN "activity_assignments" ON "activities"."id" = "activity_assignments"."activity_id" WHERE "activity_assignments"."outing_id" = 1 AND "activities"."id" = 1 LIMIT 1
---
<%= check_box_tag "outing[activity_ids][]", activity.id, outing.activities.include?(activity), :id => "outing_activity_ids_#{activity.id}" -%>