app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @activity = Activity.find(params[:id])

INSERT INTO "activities" ("attribute_id", "created_at", "description", "duration", "location", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy