app/controllers/attributes_controller.rb

SELECT "attributes".* FROM "attributes"
---
  def index
    @attributes = Attribute.all

SELECT "attributes".* FROM "attributes" WHERE "attributes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @attribute = Attribute.find(params[:id])

INSERT INTO "attributes" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 22 Nov 2011 06:10:15 UTC +00:00], ["description", "Anything related to outside"], ["title", "Outdoor"], ["updated_at", Tue, 22 Nov 2011 06:10:15 UTC +00:00]]
---
  def create
    @attribute = Attribute.new(params[:attribute])

    respond_to do |format|
      if @attribute.save