app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 22 Nov 2011 20:41:13 UTC +00:00], ["description", "Anything outdoorsy"], ["title", "Outdoor"], ["updated_at", Tue, 22 Nov 2011 20:41:13 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save