app/controllers/outings_controller.rb

  def index
    @outings = Outing.all
---
SELECT "outings".* FROM "outings"

  def show
    @outing = Outing.find(params[:id])
---
SELECT "outings".* FROM "outings" WHERE "outings"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @outing = Outing.new
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def edit
    @outing = Outing.find(params[:id])
---
SELECT "outings".* FROM "outings" WHERE "outings"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @outing = Outing.new(params[:outing])

    respond_to do |format|
      if @outing.save
---
INSERT INTO "outings" ("created_at", "description", "rating", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 22 Nov 2011 20:22:39 UTC +00:00], ["description", "asdf"], ["rating", nil], ["title", "Fun Provo Date"], ["updated_at", Tue, 22 Nov 2011 20:22:39 UTC +00:00], ["user_id", nil]]

  def update
    @outing = Outing.find(params[:id])

    @outing.attributes = {'activity_ids' => []}.merge(params[:outing] || {})

    respond_to do |format|
      if @outing.update_attributes(params[:outing])
---
SELECT "outings".* FROM "outings" WHERE "outings"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "outings" SET "title" = 'New!', "description" = 'Yay', "rating" = 5, "updated_at" = '2011-11-22 23:01:04.098868' WHERE "outings"."id" = 2